src/oy29/conf/Documents/ДополнительныеЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ДополнительныеЗатраты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Партии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/oy29/conf/AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/oy29/conf/Documents/ДополнительныеЗатраты/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеЗатратыПартии.Партия КАК Партия
		|ПОМЕСТИТЬ втТЧ
		|ИЗ
		|	Документ.ДополнительныеЗатраты.Партии КАК ДополнительныеЗатратыПартии
		|ГДЕ
		|	ДополнительныеЗатратыПартии.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧ.Партия КАК Партия
		|ИЗ
		|	втТЧ КАК втТЧ");
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Партия", "Партия");
	Блокировка.Заблокировать();
	
	Движения.ОстаткиНоменклатуры.Очистить();
	Движения.ОстаткиНоменклатуры.Записать(); // флаг Движения.ОстаткиНоменклатуры.Записывать всё ещё взведён
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОбороты.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОбороты.Партия КАК Партия,
		|	ОстаткиНоменклатурыОбороты.Период КАК Период,
		|	ОстаткиНоменклатурыОбороты.КоличествоПриход КАК КоличествоПриход,
		|	ОстаткиНоменклатурыОбороты.КоличествоРасход КАК КоличествоРасход
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Обороты(
		|			,
		|			,
		|			Секунда,
		|			Партия В
		|				(ВЫБРАТЬ
		|					втТЧ.Партия
		|				ИЗ
		|					втТЧ)) КАК ОстаткиНоменклатурыОбороты
		|ИТОГИ
		|	СУММА(КоличествоПриход)
		|ПО
		|	ОБЩИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаОбщая = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщая.Следующий();
	
	КоличествоВсего = ВыборкаОбщая.КоличествоПриход;
	Если КоличествоВсего = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = ВыборкаОбщая.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоПриход <> 0 Тогда
			Движение = Движения.ОстаткиНоменклатуры.ДобавитьПриход();
			Движение.Период			 = Выборка.Период;
			Движение.Номенклатура	 = Выборка.Номенклатура;
			Движение.Партия			 = Выборка.Партия;
			Движение.Стоимость		 = СуммаЗатрат * Выборка.КоличествоПриход / КоличествоВсего;
		КонецЕсли;
		
		Если Выборка.КоличествоРасход <> 0 Тогда
			Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
			Движение.Период			 = Выборка.Период;
			Движение.Номенклатура	 = Выборка.Номенклатура;
			Движение.Партия			 = Выборка.Партия;
			Движение.Стоимость		 = СуммаЗатрат * Выборка.КоличествоРасход / КоличествоВсего;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
